In [1]:
# BASE
# ------------------------------------------------------
import numpy as np
import pandas as pd
import os
import gc
import warnings

# PACF - ACF
# ------------------------------------------------------
import statsmodels.api as sm

# DATA VISUALIZATION
# ------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px


# CONFIGURATIONS
# ------------------------------------------------------
pd.set_option('display.max_columns', None)
pd.options.display.float_format = '{:.2f}'.format
warnings.filterwarnings('ignore')

C:\Users\21ckw\anaconda3\lib\site-packages\statsmodels\tsa\base\tsa_model.py:7: FutureWarning: pandas.Int64Index is deprecated and will be removed from pandas in a future version. Use pandas.Index with the appropriate dtype instead.
  from pandas import (to_datetime, Int64Index, DatetimeIndex, Period,
C:\Users\21ckw\anaconda3\lib\site-packages\statsmodels\tsa\base\tsa_model.py:7: FutureWarning: pandas.Float64Index is deprecated and will be removed from pandas in a future version. Use pandas.Index with the appropriate dtype instead.
  from pandas import (to_datetime, Int64Index, DatetimeIndex, Period,

# 데이터 설명

## train.csv
* store_nbr identifies the store at which the products are sold. : 물건이 팔린 상점
* family identifies the type of product sold. : 팔린 물건 종류 
* sales gives the total sales for a product family at a particular store at a given date.Fractional values are possible since products can be sold in fractional units (1.5 kg of cheese, for instance, as opposed to 1 bag of chips). : 매출
* onpromotion gives the total number of items in a product family that were being promoted at a store at a given date. :프로모션 상품 수

In [2]:
train = pd.read_csv('./data/train.csv')
print('shape :',train.shape)
print(train.info())
train.head()

shape : (3000888, 6)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000888 entries, 0 to 3000887
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   id           int64
 1   date         object
 2   store_nbr    int64
 3   family       object
 4   sales        float64
 5   onpromotion  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 137.4+ MB
None

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE   0.00            0
1   1  2013-01-01          1   BABY CARE   0.00            0
2   2  2013-01-01          1      BEAUTY   0.00            0
3   3  2013-01-01          1   BEVERAGES   0.00            0
4   4  2013-01-01          1       BOOKS   0.00            0

## test.csv
* train.csv 와 같은내용
* The dates in the test data are for the 15 days after the last date in the training data : train.csv 로부터 15일 이후

In [3]:
test = pd.read_csv('./data/test.csv')
print('shape :',test.shape)
print(test.info())
test.head()

shape : (28512, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28512 entries, 0 to 28511
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           28512 non-null  int64
 1   date         28512 non-null  object
 2   store_nbr    28512 non-null  int64
 3   family       28512 non-null  object
 4   onpromotion  28512 non-null  int64
dtypes: int64(3), object(2)
memory usage: 1.1+ MB
None

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

## stores.csv
* cluster is a grouping of similar stores. : 비슷한 가게들의 분류

In [4]:
stores = pd.read_csv('./data/stores.csv')
print('shape :',stores.shape)
print(stores.info())
stores.head()

shape : (54, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_nbr  54 non-null     int64
 1   city       54 non-null     object
 2   state      54 non-null     object
 3   type       54 non-null     object
 4   cluster    54 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.2+ KB
None

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

## transactions.csv

In [5]:
transactions = pd.read_csv('./data/transactions.csv').sort_values(['store_nbr','date'])
print('shape :',transactions.shape)
print(transactions.info())
transactions.head()

shape : (83488, 3)
<class 'pandas.core.frame.DataFrame'>
Int64Index: 83488 entries, 1 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 2.5+ MB
None

           date  store_nbr  transactions
1    2013-01-02          1          2111
47   2013-01-03          1          1833
93   2013-01-04          1          1863
139  2013-01-05          1          1509
185  2013-01-06          1           520

## holidays_events.csv
* transferred :A holiday that is transferred officially falls on that calendar day, but was moved to another date by the government<br>
 -> 달력날짜가 아닌 정부에 의해 옮겨진 공휴일<br>
 -> ex. 2012-10-09 -> 2012-10-12 라면 2012-10-12 에 휴일

In [10]:
holidays_events = pd.read_csv('./data/holidays_events.csv')
print('shape :',holidays_events.shape)
holidays_events.head()

shape : (350, 6)

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [11]:
holidays_events['transferred'].unique()

array([False,  True])

# 데이터 파악

In [6]:
train["date"] = pd.to_datetime(train.date)
test["date"] = pd.to_datetime(test.date)
transactions["date"] = pd.to_datetime(transactions.date)

train.onpromotion = train.onpromotion.astype("float16")
train.sales = train.sales.astype("float32")
stores.cluster = stores.cluster.astype("int8")

In [7]:
transactions.head(10)

          date  store_nbr  transactions
1   2013-01-02          1          2111
47  2013-01-03          1          1833
93  2013-01-04          1          1863
139 2013-01-05          1          1509
185 2013-01-06          1           520
231 2013-01-07          1          1807
277 2013-01-08          1          1869
323 2013-01-09          1          1910
369 2013-01-10          1          1679
415 2013-01-11          1          1813

In [8]:
# 
train.groupby(['date','store_nbr']).sum()

                            id    sales  onpromotion
date       store_nbr
2013-01-01 1               528     0.00         0.00
           2             12507     0.00         0.00
           3             24486     0.00         0.00
           4             36465     0.00         0.00
           5             48444     0.00         0.00
...                        ...      ...          ...
2017-08-15 50         99020031 16879.12       150.00
           51         99021120 20154.56       127.00
           52         99022209 18600.05       142.00
           53         99023298  8208.19       114.00
           54         99024387 12666.86       204.00

[90936 rows x 3 columns]

In [9]:
train.groupby(['date','store_nbr']).sum().reset_index()

            date  store_nbr        id    sales  onpromotion
0     2013-01-01          1       528     0.00         0.00
1     2013-01-01          2     12507     0.00         0.00
2     2013-01-01          3     24486     0.00         0.00
3     2013-01-01          4     36465     0.00         0.00
4     2013-01-01          5     48444     0.00         0.00
...          ...        ...       ...      ...          ...
90931 2017-08-15         50  99020031 16879.12       150.00
90932 2017-08-15         51  99021120 20154.56       127.00
90933 2017-08-15         52  99022209 18600.05       142.00
90934 2017-08-15         53  99023298  8208.19       114.00
90935 2017-08-15         54  99024387 12666.86       204.00

[90936 rows x 5 columns]

In [ ]:
tra

In [ ]:
temp = pd.merge(train.groupby(["date", "store_nbr"]).sales.sum().reset_index(), transactions, how = "left")
print("Spearman Correlation between Total Sales and Transactions: {:,.4f}".format(temp.corr("spearman").sales.loc["transactions"]))
px.line(transactions.sort_values(["store_nbr", "date"]), x='date', y='transactions', color='store_nbr',title = "Transactions" )